package com.example.feature_alignment_impl.presentation.rv_alignment

import com.example.feature_alignment_impl.R

object  ItemsRepository {
    val alignments = arrayListOf<ItemModel>(
        ItemModel(1, "Кельтский крест", R.drawable.cross, "Кельтский крест - один из самых известных и самых старинных раскладов карт Таро. Он наиболее универсален, то есть подходит для ответов на любые вопросы, особенно о том, как будут развиваться события, в чем причины происходящего, что ожидает человека или как возникла та или иная ситуация."),
        ItemModel(2, "Ваше будущее", R.drawable.future, "Этот расклад не только поможет пролить свет на некоторые события и тенденции в будущем, но и сможет направить Вас и подсказать план действий."),
        ItemModel(3, "Рабочий прогноз", R.drawable.job, "Таро - это мощный инструмент для толкования вашего профессионального развития. Гадание помогает нам понять, где мы находимся в моменте сейчас и как продвинуться на следующий уровень."),
        ItemModel(4, "Финансовое благополучие", R.drawable.money, "Каковы основные причины проблем в финансах, как складывается настоящее положение вещей с деньгами или в бизнесе, что может помочь в работе для улучшения ситуации? На все эти вопросы ответит данное финансовое гадание."),
        ItemModel(5, "Отношения", R.drawable.relation, "Карты помогут тебе прояснить свои собственные страхи, желания и интуитивные ощущения, например о том, что для тебя значат новые отношения, как ты видишь в них себя и ощущаешь ли в них потенциал"),
        ItemModel(6, "Да или нет", R.drawable.yesno, "Гадание «Да-Нет» позволяет выяснить, что готовит нам будущее, и определиться с принятием того либо иного решения. Оно позволяет получить однозначный ответ на поставленный соответствующим образом вопрос."),
    )
}